app/Models/AutoresModel.php

    public function getAutores()
    {
        return $this->findAll();
---
SELECT *
FROM `autores`

    public function add($dato)
    {
        return $this->save($dato);
---
INSERT INTO `autores` (`nombre`, `apellido`, `pais`, `fechaR`) VALUES ('Erlin', 'Angomas', 'Republica Dominicana ', '2023-01-03')